# ScaledOuterPerimeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..ScaledOuterPerimeter Property
IFCExtrusionCreationData Class See Also
---
The outer perimeter of the extrusion, scaled to the units of export.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double ScaledOuterPerimeter { get; set; }
```

Visual Basic
---
```text
Public Property ScaledOuterPerimeter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ScaledOuterPerimeter {
	double get ();
	void set (double value);
}
```

# ### Field Value
This value represents the perimeter of the outermost curve loop bounding the area of the extrusion. Zero if the perimeter has never been set on this object.
# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace